# Intro to SQL in python

In [1]:
# To use SQL ipython-sql pacakge is downloaded. Use pip install ipython-sql 
#The ipython-sql library is loaded using %load_ext.
# Import SQL libraries
import sqlite3
%load_ext sql

In [2]:
# Import other libraries
import pandas as pd

## Create a database in SQL

In [3]:
# Create the database that contains all the dataframes
# Only in ipython sqlite
%sql sqlite:///databases/database.db3

In [4]:
# Load the restaurants dataframe
url = 'https://raw.githubusercontent.com/ricardopretelt/data-analysis-in-python/master/databases/Datafiniti_Fast_Food_Restaurants.csv'
restaurants = pd.read_csv(url)
# Create the employee dataframe
employee = pd.DataFrame({
  'ID': [1, 2, 3, 4],
  'Name': ["Richard", "Claudia", "Phillip", "Mary"],
  'Last_Name': ["white", "Anderson", "Johnson", "Smith"],
  'Gender': ["Male", "Female", "Male", "Female"],
  'Job': ["Assistant", "Manager", "Engineer", "Director"],
  'Salary': [1400, 2000, 2200, 3000],
})

In [5]:
# Persist the dataframes inside the database with PERSIST.
# Only in ipython sqlite
%sql --persist restaurants
%sql --persist employee

 * sqlite:///databases/database.db3
 * sqlite:///databases/database.db3

'Persisted employee'

In [6]:
# Create a table with constrains from scratch
%sql CREATE TABLE clients (id INTEGER PRIMARY KEY, name TEXT NOT NULL, paid TEXT DEFAULT 'credit card');

 * sqlite:///databases/database.db3
Done.

[]

In [7]:
%sql SELECT * FROM clients;

 * sqlite:///databases/database.db3
Done.

[]

## Query data from table

In [8]:
# Do a query in SQL with just 4 instances, all columns
%sql SELECT * FROM restaurants LIMIT 4;

 * sqlite:///databases/database.db3
Done.

[(0, 'AVwcmSyZIN2L1WUfmxyw', '2015-10-19T23:47:58Z', '2018-06-26T03:00:14Z', '800 N Canal Blvd', 'American Restaurant and Fast Food Restaurant', 'Thibodaux', 'US', 'us/la/thibodaux/800ncanalblvd/1780593795', 29.814697, -90.814742, 'SONIC Drive In', '70301', 'LA', 'https://foursquare.com/v/sonic-drive-in/4b73615df964a520abab2de3/menu,https://foursquare.com/v/sonic-drive-in/4b73615df964a520abab2de3,http://tripadv ... (11 characters truncated) ... staurant_Review-g40459-d4654052-Reviews-Sonic_Drive_In-Thibodaux_Louisiana.html,https://www.yellowpages.com/thibodaux-la/mip/sonic-drive-in-468367546', 'https://locations.sonicdrivein.com/la/thibodaux/800-north-canal-boulevard.html,http://sonicdrivein.com,http://www.sonicdrivein.com'),
 (1, 'AVwcmSyZIN2L1WUfmxyw', '2015-10-19T23:47:58Z', '2018-06-26T03:00:14Z', '800 N Canal Blvd', 'Fast Food Restaurants', 'Thibodaux', 'US', 'us/la/thibodaux/800ncanalblvd/1780593795', 29.814697, -90.814742, 'SONIC Drive In', '70301', 'LA', 'https://foursquare.com/v/sonic-drive-in/4b73615df964a520abab2de3/menu,https://foursquare.com/v/sonic-drive-in/4b73615df964a520abab2de3,http://tripadv ... (11 characters truncated) ... staurant_Review-g40459-d4654052-Reviews-Sonic_Drive_In-Thibodaux_Louisiana.html,https://www.yellowpages.com/thibodaux-la/mip/sonic-drive-in-468367546', 'https://locations.sonicdrivein.com/la/thibodaux/800-north-canal-boulevard.html,http://sonicdrivein.com,http://www.sonicdrivein.com'),
 (2, 'AVwcopQoByjofQCxgfVa', '2016-03-29T05:06:36Z', '2018-06-26T02:59:52Z', '206 Wears Valley Rd', 'Fast Food Restaurant', 'Pigeon Forge', 'US', 'us/tn/pigeonforge/206wearsvalleyrd/-864103396', 35.803788, -83.580553, 'Taco Bell', '37863', 'TN', 'https://www.yellowpages.com/pigeon-forge-tn/mip/taco-bell-474241430,https://foursquare.com/v/taco-bell/4ded6885d22deb0316df557d/menu,https://foursquare.com/v/taco-bell/4ded6885d22deb0316df557d', 'http://www.tacobell.com,https://locations.tacobell.com/tn/pigeon-forge/206-wears-valley-road.html?utm_source=yextandutm_campaign=yextpowerlistingsandutm_medium=referralandutm_term=026432andutm_content=website'),
 (3, 'AVweXN5RByjofQCxxilK', '2017-01-03T07:46:11Z', '2018-06-26T02:59:51Z', '3652 Parkway', 'Fast Food', 'Pigeon Forge', 'US', 'us/tn/pigeonforge/3652parkway/93075755', 35.782339, -83.551408, "Arby's", '37863', 'TN', 'http://www.yellowbook.com/profile/arbys_1633893026.html,https://foursquare.com/v/arbys/4bae29f8f964a520348c3be3,https://www.yellowpages.com/pigeon-fo ... (105 characters truncated) ... om/Restaurant_Review-g55270-d1123265-Reviews-Arby_s-Pigeon_Forge_Tennessee.html,http://www.citysearch.com/profile/9409306/pigeon_forge_tn/arby_s.html', 'http://www.arbys.com,https://locations.arbys.com/us/tn/pigeon-forge/3652-parkway.html')]

In [9]:
# do a query with specific columns and limit results
%sql SELECT city, country, name FROM restaurants LIMIT 4;

 * sqlite:///databases/database.db3
Done.

[('Thibodaux', 'US', 'SONIC Drive In'),
 ('Thibodaux', 'US', 'SONIC Drive In'),
 ('Pigeon Forge', 'US', 'Taco Bell'),
 ('Pigeon Forge', 'US', "Arby's")]

## Create new column in table

In [10]:
%sql ALTER TABLE clients ADD COLUMN health TEXT;

 * sqlite:///databases/database.db3
Done.

[]

In [11]:
%sql SELECT * FROM clients;

 * sqlite:///databases/database.db3
Done.

[]

## Insert new row in table

In [12]:
%sql INSERT INTO clients (id, name, paid, health) VALUES (1, 'Peter Hopkins', 'credit card', 'good');

 * sqlite:///databases/database.db3
1 rows affected.

[]

In [13]:
%sql SELECT * FROM clients;

 * sqlite:///databases/database.db3
Done.

[(1, 'Peter Hopkins', 'credit card', 'good')]

## Edit row in table

In [14]:
%sql UPDATE clients SET health = 'not so good' WHERE id = 1;

 * sqlite:///databases/database.db3
1 rows affected.

[]

In [15]:
%sql SELECT * FROM clients;

 * sqlite:///databases/database.db3
Done.

[(1, 'Peter Hopkins', 'credit card', 'not so good')]

## Delete row in table

In [16]:
%sql DELETE FROM clients WHERE id=1;

 * sqlite:///databases/database.db3
1 rows affected.

[]

In [17]:
%sql SELECT * FROM clients;

 * sqlite:///databases/database.db3
Done.

[]

## _As_ to rename a column in a query

In [18]:
# Change the name of a column in a query with As
%sql SELECT city, country, name As Restaurants FROM restaurants LIMIT 4;

 * sqlite:///databases/database.db3
Done.

[('Thibodaux', 'US', 'SONIC Drive In'),
 ('Thibodaux', 'US', 'SONIC Drive In'),
 ('Pigeon Forge', 'US', 'Taco Bell'),
 ('Pigeon Forge', 'US', "Arby's")]

## Query unique values

In [19]:
# To get list of unique provinces
%sql SELECT DISTINCT(country) FROM restaurants;

 * sqlite:///databases/database.db3
Done.

[('US',)]

## Query for coincidences

In [20]:
# To create a more complex database
articles = pd.DataFrame({
  'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
  'Product': ["TP", "Rice", "Tomatoes", "Mayonnaise", "Soap", "Bread", "Beans", "Potatoes", "Apples",
             "Cheese"],
  'Location_Hall': [2, 3, 4, 5, 2, 3, 3, 3, 4, 4],
  'Available': ["Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "No", "Yes"],
  'Class': ["A", "B", "A", "A", "B", "A", "B", "A", "A", "B"],
  'Cost': [20, 30, 15, 10, 13, 12, 35, 40, 20, 30]
})
%sql --persist articles

 * sqlite:///databases/database.db3

'Persisted articles'

In [21]:
# Query with 1 character variable
%sql SELECT * FROM articles where Product LIKE 'T_';

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'TP', 2, 'Yes', 'A', 20)]

In [22]:
# Query with variable ending and beginning
%sql SELECT * FROM articles where Product LIKE '%T%';

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'TP', 2, 'Yes', 'A', 20),
 (2, 3, 'Tomatoes', 4, 'Yes', 'A', 15),
 (7, 8, 'Potatoes', 3, 'Yes', 'A', 40)]

## Query by filtering with missing values

In [23]:
# To find instances with null values
%sql SELECT * FROM articles where Location_Hall IS NULL;

 * sqlite:///databases/database.db3
Done.

[]

In [24]:
# To find instances with not null values
%sql SELECT * FROM articles where Location_Hall IS NOT NULL LIMIT 3;

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'TP', 2, 'Yes', 'A', 20),
 (1, 2, 'Rice', 3, 'Yes', 'B', 30),
 (2, 3, 'Tomatoes', 4, 'Yes', 'A', 15)]

## To filter range of values

In [25]:
# Closed interval, all values from 2000 to 2200
%sql SELECT Name, Salary FROM employee WHERE Salary BETWEEN 2000 and 2200;

 * sqlite:///databases/database.db3
Done.

[('Claudia', 2000), ('Phillip', 2200)]

In [26]:
# Closed interval, all values from 'A' to 'Q'
# Starting from all words beginning with A until the letter Q
# Q is included but QA not
%sql SELECT Name, Salary FROM employee WHERE Name BETWEEN 'A' and 'Q';

 * sqlite:///databases/database.db3
Done.

[('Claudia', 2000), ('Phillip', 2200), ('Mary', 3000)]

## Logic operators

In [27]:
# And operator
%sql SELECT * FROM employee WHERE (Salary>1000) and (Gender='Female')

 * sqlite:///databases/database.db3
Done.

[(1, 2, 'Claudia', 'Anderson', 'Female', 'Manager', 2000),
 (3, 4, 'Mary', 'Smith', 'Female', 'Director', 3000)]

In [28]:
# Or operator
%sql SELECT * FROM employee WHERE (Salary>2000) or (Gender='Male')

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'Richard', 'white', 'Male', 'Assistant', 1400),
 (2, 3, 'Phillip', 'Johnson', 'Male', 'Engineer', 2200),
 (3, 4, 'Mary', 'Smith', 'Female', 'Director', 3000)]

In [29]:
# Not operator
%sql SELECT * FROM employee WHERE ID not in (1,2,4)

 * sqlite:///databases/database.db3
Done.

[(2, 3, 'Phillip', 'Johnson', 'Male', 'Engineer', 2200)]

## Order query

In [30]:
# Order a query from min to max
%sql SELECT * FROM employee ORDER BY Salary;

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'Richard', 'white', 'Male', 'Assistant', 1400),
 (1, 2, 'Claudia', 'Anderson', 'Female', 'Manager', 2000),
 (2, 3, 'Phillip', 'Johnson', 'Male', 'Engineer', 2200),
 (3, 4, 'Mary', 'Smith', 'Female', 'Director', 3000)]

In [31]:
# Order a query from max to min
%sql SELECT * FROM employee ORDER BY Salary DESC;

 * sqlite:///databases/database.db3
Done.

[(3, 4, 'Mary', 'Smith', 'Female', 'Director', 3000),
 (2, 3, 'Phillip', 'Johnson', 'Male', 'Engineer', 2200),
 (1, 2, 'Claudia', 'Anderson', 'Female', 'Manager', 2000),
 (0, 1, 'Richard', 'white', 'Male', 'Assistant', 1400)]

## Create output using if then logic

In [32]:
%sql SELECT Name, CASE WHEN Salary > 2900 THEN 'Executive' WHEN Salary > 2000 THEN 'Senior' ELSE 'Junior' END AS 'Ranking in role' FROM employee;

 * sqlite:///databases/database.db3
Done.

[('Richard', 'Junior'),
 ('Claudia', 'Junior'),
 ('Phillip', 'Senior'),
 ('Mary', 'Executive')]

## Aggregate functions

In [33]:
# To use count 
%sql SELECT COUNT(City) as City_count FROM restaurants;

 * sqlite:///databases/database.db3
Done.

[(10000,)]

In [34]:
# To use values in a column
%sql SELECT SUM(Salary) as Salary_Sum From Employee;

 * sqlite:///databases/database.db3
Done.

[(8600,)]

In [35]:
# To use max
%sql SELECT MAX(Salary) as Max_Salary FROM employee;

 * sqlite:///databases/database.db3
Done.

[(3000,)]

In [36]:
# To use min
%sql SELECT MIN(Salary) as Min_Salary FROM employee;

 * sqlite:///databases/database.db3
Done.

[(1400,)]

In [37]:
# To get the mean from a column
%sql SELECT AVG(Salary) AS Salary_Mean FROM employee;

 * sqlite:///databases/database.db3
Done.

[(2150.0,)]

In [38]:
# To round values to 2 decimals
%sql SELECT ROUND(AVG(Salary),2) AS rounded_avg FROM employee;

 * sqlite:///databases/database.db3
Done.

[(2150.0,)]

## Use of _GROUP BY_

In [39]:
# To group columns by name to know how many there are per city.
%sql SELECT name, COUNT(city) AS restaurant FROM restaurants GROUP BY name ORDER BY restaurant DESC LIMIT 4;

 * sqlite:///databases/database.db3
Done.

[("McDonald's", 1898),
 ('Taco Bell', 1032),
 ('Burger King', 833),
 ('Subway', 776)]

In [40]:
# To count for all values and group by
%sql SELECT Gender, COUNT(*) AS count_per_gender FROM employee GROUP BY Gender;

 * sqlite:///databases/database.db3
Done.

[('Female', 2), ('Male', 2)]

In [41]:
# Group per 2 fields
%sql SELECT Class, Available, COUNT(*) AS Products FROM articles GROUP BY Class, Available;

 * sqlite:///databases/database.db3
Done.

[('A', 'No', 1), ('A', 'Yes', 5), ('B', 'Yes', 4)]

In [42]:
# Use of having: A condition in groups
%sql SELECT Location_Hall, COUNT(*) AS Products FROM articles GROUP BY Location_Hall HAVING count(*)>1;

 * sqlite:///databases/database.db3
Done.

[(2, 2), (3, 4), (4, 3)]

## Multiple tables

In [43]:
# Creating multiple tables that are related
orders = pd.DataFrame({
  'Order_ID': [1, 2, 3],
  'Customer_ID': [2, 3, 2],
  'Product_ID': [1,3,2],
  'Purchase_Date': ["2020-01-01", "2020-06-21", "2020-08-13"]
})
%sql --persist orders

 * sqlite:///databases/database.db3

'Persisted orders'

In [44]:
products = pd.DataFrame({
  'Product_ID': [1, 2, 3],
  'Product': ["Rice", "Tomatoes", "Soap"],
  'Price': [6, 8, 3],
  'Available': ["Yes", "Yes", "Yes"],
})
%sql --persist products

 * sqlite:///databases/database.db3

'Persisted products'

In [45]:
customers = pd.DataFrame({
  'Customer_ID': [1, 2, 3],
  'Customer': ["John", "Mary", "Peter"],
  'Gender': ["Male", "Female", "Male"],
  'Age': [31, 23, 27],
})
%sql --persist customers

 * sqlite:///databases/database.db3

'Persisted customers'

In [46]:
# Damaged customer table with missing values
customers_damaged = pd.DataFrame({
  'Customer_ID': [1, 3],
  'Customer': ["John", "Peter"],
  'Gender': ["Male", "Male"],
  'Age': [31, 27],
})
%sql --persist customers_damaged

 * sqlite:///databases/database.db3

'Persisted customers_damaged'

In [48]:
# Combine tables in SQL with simple JOIN (INNER JOIN)
%sql SELECT Order_ID, orders.Customer_ID, Customer FROM orders JOIN customers ON orders.Customer_ID=customers.Customer_ID;

 * sqlite:///databases/database.db3
Done.

[(1, 2, 'Mary'), (2, 3, 'Peter'), (3, 2, 'Mary')]

In [49]:
# left JOIN: The word outer is not necessary but recommended
%sql SELECT Customer, Age, Order_ID, Purchase_Date FROM customers_damaged LEFT OUTER JOIN orders ON customers_damaged.Customer_ID = orders.Customer_ID;

 * sqlite:///databases/database.db3
Done.

[('John', 31, None, None), ('Peter', 27, 2, '2020-06-21')]

In [50]:
# CROSSS JOIN: A form of cartesian product
%sql SELECT Customer, Product FROM customers_damaged CROSS JOIN products;

 * sqlite:///databases/database.db3
Done.

[('John', 'Rice'),
 ('John', 'Tomatoes'),
 ('John', 'Soap'),
 ('Peter', 'Rice'),
 ('Peter', 'Tomatoes'),
 ('Peter', 'Soap')]

In [52]:
# UNION: To stack datasets organized by index
%sql SELECT * FROM customers_damaged UNION SELECT * FROM customers;

 * sqlite:///databases/database.db3
Done.

[(0, 1, 'John', 'Male', 31),
 (1, 2, 'Mary', 'Female', 23),
 (1, 3, 'Peter', 'Male', 27),
 (2, 3, 'Peter', 'Male', 27)]

In [53]:
# WITH: To combine queries, one inside of another
%sql WITH previous_query AS(SELECT Order_ID, Customer_ID, products.Product, Purchase_Date FROM orders JOIN Products ON orders.Product_ID=Products.Product_ID) SELECT previous_query.Order_ID, customers.Customer, previous_query.Product, previous_query.Purchase_Date FROM previous_query JOIN customers ON previous_query.Customer_ID=customers.Customer_ID;

 * sqlite:///databases/database.db3
Done.

[(1, 'Mary', 'Rice', '2020-01-01'),
 (2, 'Peter', 'Soap', '2020-06-21'),
 (3, 'Mary', 'Tomatoes', '2020-08-13')]